---
kind: method
id: M:Autodesk.Revit.DB.PlanCircuitSet.#ctor
source: html/3c2d81cf-0ded-6d08-7547-bd9e06756614.htm
---
# Autodesk.Revit.DB.PlanCircuitSet.#ctor Method

Initializes a new instance of the PlanCircuitSet class

## Syntax (C#)
```csharp
public PlanCircuitSet()
```